12emilia21/Fault-Location-Implementation/buck_converter_dma_original/c2000.syscfg
gpio2.direction                 = "GPIO_DIR_MODE_OUT";
gpio2.useInterrupt              = true;
gpio2.$name                     = "transient_det_pin";
gpio2.writeInitialValue         = true;
gpio2.gpioPin.$assign           = "ball.51";
gpio2.xint.intType              = "GPIO_INT_TYPE_RISING_EDGE";
gpio2.xint.enableInt            = true;
gpio2.xint.registerInterrupts   = true;
gpio2.xint.xInt.enableInterrupt = true;

gpio3.$name                     = "tz_pin";
gpio3.initialValue              = 1;
gpio3.writeInitialValue         = true;
gpio3.useInterrupt              = true;
gpio3.gpioPin.$assign           = "ball.54";
gpio3.xint.xintNum              = "GPIO_INT_XINT2";
gpio3.xint.intType              = "GPIO_INT_TYPE_RISING_EDGE";
gpio3.xint.enableInt            = true;
gpio3.xint.registerInterrupts   = true;
gpio3.xint.xInt.enableInterrupt = true;

inputxbar_input1.$name         = "myINPUTXBARINPUT0";
gpio2.xint.inputxbar           = inputxbar_input1;
inputxbar_input1.inputxbarGpio = "GPIO12";

inputxbar_input2.$name          = "myINPUTXBARINPUT1";
gpio3.xint.inputxbar            = inputxbar_input2;
inputxbar_input2.inputxbarGpio  = "GPIO31";
inputxbar_input2.inputxbarLock  = true;
inputxbar_input2.inputxbarInput = "XBAR_INPUT5";

memcfg.config_MEMCFG_SECT_LS0 = "CLA_prog";
memcfg.config_MEMCFG_SECT_LS2 = "CLA_data";
memcfg.config_MEMCFG_SECT_LS3 = "CLA_data";
memcfg.config_MEMCFG_SECT_LS4 = "CLA_prog";

FPUfastRTS1.$name = "myFFR0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm2.epwm.epwm_aPin.$suggestSolution = "ball.77";
epwm2.epwm.epwm_bPin.$suggestSolution = "ball.76";
epwm3.epwm.$suggestSolution           = "EPWM3";
epwm3.epwm.epwm_aPin.$suggestSolution = "ball.75";
epwm3.epwm.epwm_bPin.$suggestSolution = "ball.89";
